virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/usart.h
/* -------- US_MR : (USART Offset: 0x04) (R/W 32) Mode Register -------- */
#define US_MR_USART_MODE_Pos                  _U_(0)                                               /**< (US_MR) USART Mode of Operation Position */
#define US_MR_USART_MODE_Msk                  (_U_(0xF) << US_MR_USART_MODE_Pos)                   /**< (US_MR) USART Mode of Operation Mask */
#define US_MR_USART_MODE(value)               (US_MR_USART_MODE_Msk & ((value) << US_MR_USART_MODE_Pos))
#define   US_MR_USART_MODE_NORMAL_Val         _U_(0x0)                                             /**< (US_MR) Normal mode  */
#define   US_MR_USART_MODE_RS485_Val          _U_(0x1)                                             /**< (US_MR) RS485 mode  */
#define   US_MR_USART_MODE_HW_HANDSHAKING_Val _U_(0x2)                                             /**< (US_MR) Hardware Handshaking  */
#define   US_MR_USART_MODE_IS07816_T_0_Val    _U_(0x4)                                             /**< (US_MR) IS07816 Protocol: T = 0  */
#define   US_MR_USART_MODE_IS07816_T_1_Val    _U_(0x6)                                             /**< (US_MR) IS07816 Protocol: T = 1  */
#define   US_MR_USART_MODE_IRDA_Val           _U_(0x8)                                             /**< (US_MR) IrDA mode  */
#define   US_MR_USART_MODE_LIN_MASTER_Val     _U_(0xA)                                             /**< (US_MR) LIN master mode  */
#define   US_MR_USART_MODE_LIN_SLAVE_Val      _U_(0xB)                                             /**< (US_MR) LIN Slave mode  */
#define   US_MR_USART_MODE_SPI_MASTER_Val     _U_(0xE)                                             /**< (US_MR) SPI master mode  */
#define   US_MR_USART_MODE_SPI_SLAVE_Val      _U_(0xF)                                             /**< (US_MR) SPI Slave mode  */
#define US_MR_USART_MODE_NORMAL               (US_MR_USART_MODE_NORMAL_Val << US_MR_USART_MODE_Pos) /**< (US_MR) Normal mode Position  */
#define US_MR_USART_MODE_RS485                (US_MR_USART_MODE_RS485_Val << US_MR_USART_MODE_Pos) /**< (US_MR) RS485 mode Position  */
#define US_MR_USART_MODE_HW_HANDSHAKING       (US_MR_USART_MODE_HW_HANDSHAKING_Val << US_MR_USART_MODE_Pos) /**< (US_MR) Hardware Handshaking Position  */
#define US_MR_USART_MODE_IS07816_T_0          (US_MR_USART_MODE_IS07816_T_0_Val << US_MR_USART_MODE_Pos) /**< (US_MR) IS07816 Protocol: T = 0 Position  */
#define US_MR_USART_MODE_IS07816_T_1          (US_MR_USART_MODE_IS07816_T_1_Val << US_MR_USART_MODE_Pos) /**< (US_MR) IS07816 Protocol: T = 1 Position  */
#define US_MR_USART_MODE_IRDA                 (US_MR_USART_MODE_IRDA_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) IrDA mode Position  */
#define US_MR_USART_MODE_LIN_MASTER           (US_MR_USART_MODE_LIN_MASTER_Val << US_MR_USART_MODE_Pos) /**< (US_MR) LIN master mode Position  */
#define US_MR_USART_MODE_LIN_SLAVE            (US_MR_USART_MODE_LIN_SLAVE_Val << US_MR_USART_MODE_Pos) /**< (US_MR) LIN Slave mode Position  */
#define US_MR_USART_MODE_SPI_MASTER           (US_MR_USART_MODE_SPI_MASTER_Val << US_MR_USART_MODE_Pos) /**< (US_MR) SPI master mode Position  */
#define US_MR_USART_MODE_SPI_SLAVE            (US_MR_USART_MODE_SPI_SLAVE_Val << US_MR_USART_MODE_Pos) /**< (US_MR) SPI Slave mode Position  */
#define US_MR_USCLKS_Pos                      _U_(4)                                               /**< (US_MR) Clock Selection Position */
#define US_MR_USCLKS_Msk                      (_U_(0x3) << US_MR_USCLKS_Pos)                       /**< (US_MR) Clock Selection Mask */
#define US_MR_USCLKS(value)                   (US_MR_USCLKS_Msk & ((value) << US_MR_USCLKS_Pos))  
#define   US_MR_USCLKS_MCK_Val                _U_(0x0)                                             /**< (US_MR) Peripheral clock is selected  */
#define   US_MR_USCLKS_DIV_Val                _U_(0x1)                                             /**< (US_MR) Peripheral clock divided (DIV=8) is selected  */
#define   US_MR_USCLKS_PMC_PCK_Val            _U_(0x2)                                             /**< (US_MR) PMC programmable clock (PCK) is selected.If the SCK pin is driven (CLKO=1), the CD field must be greater than 1.  */
#define   US_MR_USCLKS_SCK_Val                _U_(0x3)                                             /**< (US_MR) External pin (SCK) is selected  */
#define US_MR_USCLKS_MCK                      (US_MR_USCLKS_MCK_Val << US_MR_USCLKS_Pos)           /**< (US_MR) Peripheral clock is selected Position  */
#define US_MR_USCLKS_DIV                      (US_MR_USCLKS_DIV_Val << US_MR_USCLKS_Pos)           /**< (US_MR) Peripheral clock divided (DIV=8) is selected Position  */
#define US_MR_USCLKS_PMC_PCK                  (US_MR_USCLKS_PMC_PCK_Val << US_MR_USCLKS_Pos)       /**< (US_MR) PMC programmable clock (PCK) is selected.If the SCK pin is driven (CLKO=1), the CD field must be greater than 1. Position  */
#define US_MR_USCLKS_SCK                      (US_MR_USCLKS_SCK_Val << US_MR_USCLKS_Pos)           /**< (US_MR) External pin (SCK) is selected Position  */
#define US_MR_CHRL_Pos                        _U_(6)                                               /**< (US_MR) Character Length Position */
#define US_MR_CHRL_Msk                        (_U_(0x3) << US_MR_CHRL_Pos)                         /**< (US_MR) Character Length Mask */
#define US_MR_CHRL(value)                     (US_MR_CHRL_Msk & ((value) << US_MR_CHRL_Pos))      
#define   US_MR_CHRL_5_BIT_Val                _U_(0x0)                                             /**< (US_MR) Character length is 5 bits  */
#define   US_MR_CHRL_6_BIT_Val                _U_(0x1)                                             /**< (US_MR) Character length is 6 bits  */
#define   US_MR_CHRL_7_BIT_Val                _U_(0x2)                                             /**< (US_MR) Character length is 7 bits  */
#define   US_MR_CHRL_8_BIT_Val                _U_(0x3)                                             /**< (US_MR) Character length is 8 bits  */
#define US_MR_CHRL_5_BIT                      (US_MR_CHRL_5_BIT_Val << US_MR_CHRL_Pos)             /**< (US_MR) Character length is 5 bits Position  */
#define US_MR_CHRL_6_BIT                      (US_MR_CHRL_6_BIT_Val << US_MR_CHRL_Pos)             /**< (US_MR) Character length is 6 bits Position  */
#define US_MR_CHRL_7_BIT                      (US_MR_CHRL_7_BIT_Val << US_MR_CHRL_Pos)             /**< (US_MR) Character length is 7 bits Position  */
#define US_MR_CHRL_8_BIT                      (US_MR_CHRL_8_BIT_Val << US_MR_CHRL_Pos)             /**< (US_MR) Character length is 8 bits Position  */
#define US_MR_SYNC_Pos                        _U_(8)                                               /**< (US_MR) Synchronous Mode Select Position */
#define US_MR_SYNC_Msk                        (_U_(0x1) << US_MR_SYNC_Pos)                         /**< (US_MR) Synchronous Mode Select Mask */
#define US_MR_SYNC(value)                     (US_MR_SYNC_Msk & ((value) << US_MR_SYNC_Pos))      
#define US_MR_PAR_Pos                         _U_(9)                                               /**< (US_MR) Parity Type Position */
#define US_MR_PAR_Msk                         (_U_(0x7) << US_MR_PAR_Pos)                          /**< (US_MR) Parity Type Mask */
#define US_MR_PAR(value)                      (US_MR_PAR_Msk & ((value) << US_MR_PAR_Pos))        
#define   US_MR_PAR_EVEN_Val                  _U_(0x0)                                             /**< (US_MR) Even parity  */
#define   US_MR_PAR_ODD_Val                   _U_(0x1)                                             /**< (US_MR) Odd parity  */
#define   US_MR_PAR_SPACE_Val                 _U_(0x2)                                             /**< (US_MR) Parity forced to 0 (Space)  */
#define   US_MR_PAR_MARK_Val                  _U_(0x3)                                             /**< (US_MR) Parity forced to 1 (Mark)  */
#define   US_MR_PAR_NO_Val                    _U_(0x4)                                             /**< (US_MR) No parity  */
#define   US_MR_PAR_MULTIDROP_Val             _U_(0x6)                                             /**< (US_MR) Multidrop mode  */
#define US_MR_PAR_EVEN                        (US_MR_PAR_EVEN_Val << US_MR_PAR_Pos)                /**< (US_MR) Even parity Position  */
#define US_MR_PAR_ODD                         (US_MR_PAR_ODD_Val << US_MR_PAR_Pos)                 /**< (US_MR) Odd parity Position  */
#define US_MR_PAR_SPACE                       (US_MR_PAR_SPACE_Val << US_MR_PAR_Pos)               /**< (US_MR) Parity forced to 0 (Space) Position  */
#define US_MR_PAR_MARK                        (US_MR_PAR_MARK_Val << US_MR_PAR_Pos)                /**< (US_MR) Parity forced to 1 (Mark) Position  */
#define US_MR_PAR_NO                          (US_MR_PAR_NO_Val << US_MR_PAR_Pos)                  /**< (US_MR) No parity Position  */
#define US_MR_PAR_MULTIDROP                   (US_MR_PAR_MULTIDROP_Val << US_MR_PAR_Pos)           /**< (US_MR) Multidrop mode Position  */
#define US_MR_NBSTOP_Pos                      _U_(12)                                              /**< (US_MR) Number of Stop Bits Position */
#define US_MR_NBSTOP_Msk                      (_U_(0x3) << US_MR_NBSTOP_Pos)                       /**< (US_MR) Number of Stop Bits Mask */
#define US_MR_NBSTOP(value)                   (US_MR_NBSTOP_Msk & ((value) << US_MR_NBSTOP_Pos))  
#define   US_MR_NBSTOP_1_BIT_Val              _U_(0x0)                                             /**< (US_MR) 1 stop bit  */
#define   US_MR_NBSTOP_1_5_BIT_Val            _U_(0x1)                                             /**< (US_MR) 1.5 stop bits (SYNC = 0) or reserved (SYNC = 1)  */
#define   US_MR_NBSTOP_2_BIT_Val              _U_(0x2)                                             /**< (US_MR) 2 stop bits  */
#define US_MR_NBSTOP_1_BIT                    (US_MR_NBSTOP_1_BIT_Val << US_MR_NBSTOP_Pos)         /**< (US_MR) 1 stop bit Position  */
#define US_MR_NBSTOP_1_5_BIT                  (US_MR_NBSTOP_1_5_BIT_Val << US_MR_NBSTOP_Pos)       /**< (US_MR) 1.5 stop bits (SYNC = 0) or reserved (SYNC = 1) Position  */
#define US_MR_NBSTOP_2_BIT                    (US_MR_NBSTOP_2_BIT_Val << US_MR_NBSTOP_Pos)         /**< (US_MR) 2 stop bits Position  */
#define US_MR_CHMODE_Pos                      _U_(14)                                              /**< (US_MR) Channel Mode Position */
#define US_MR_CHMODE_Msk                      (_U_(0x3) << US_MR_CHMODE_Pos)                       /**< (US_MR) Channel Mode Mask */
#define US_MR_CHMODE(value)                   (US_MR_CHMODE_Msk & ((value) << US_MR_CHMODE_Pos))  
#define   US_MR_CHMODE_NORMAL_Val             _U_(0x0)                                             /**< (US_MR) Normal mode  */
#define   US_MR_CHMODE_AUTOMATIC_Val          _U_(0x1)                                             /**< (US_MR) Automatic Echo. Receiver input is connected to the TXD pin.  */
#define   US_MR_CHMODE_LOCAL_LOOPBACK_Val     _U_(0x2)                                             /**< (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input.  */
#define   US_MR_CHMODE_REMOTE_LOOPBACK_Val    _U_(0x3)                                             /**< (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin.  */
#define US_MR_CHMODE_NORMAL                   (US_MR_CHMODE_NORMAL_Val << US_MR_CHMODE_Pos)        /**< (US_MR) Normal mode Position  */
#define US_MR_CHMODE_AUTOMATIC                (US_MR_CHMODE_AUTOMATIC_Val << US_MR_CHMODE_Pos)     /**< (US_MR) Automatic Echo. Receiver input is connected to the TXD pin. Position  */
#define US_MR_CHMODE_LOCAL_LOOPBACK           (US_MR_CHMODE_LOCAL_LOOPBACK_Val << US_MR_CHMODE_Pos) /**< (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. Position  */
#define US_MR_CHMODE_REMOTE_LOOPBACK          (US_MR_CHMODE_REMOTE_LOOPBACK_Val << US_MR_CHMODE_Pos) /**< (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. Position  */
#define US_MR_MSBF_Pos                        _U_(16)                                              /**< (US_MR) Bit Order Position */
#define US_MR_MSBF_Msk                        (_U_(0x1) << US_MR_MSBF_Pos)                         /**< (US_MR) Bit Order Mask */
#define US_MR_MSBF(value)                     (US_MR_MSBF_Msk & ((value) << US_MR_MSBF_Pos))      
#define US_MR_MODE9_Pos                       _U_(17)                                              /**< (US_MR) 9-bit Character Length Position */
#define US_MR_MODE9_Msk                       (_U_(0x1) << US_MR_MODE9_Pos)                        /**< (US_MR) 9-bit Character Length Mask */
#define US_MR_MODE9(value)                    (US_MR_MODE9_Msk & ((value) << US_MR_MODE9_Pos))    
#define US_MR_CLKO_Pos                        _U_(18)                                              /**< (US_MR) Clock Output Select Position */
#define US_MR_CLKO_Msk                        (_U_(0x1) << US_MR_CLKO_Pos)                         /**< (US_MR) Clock Output Select Mask */
#define US_MR_CLKO(value)                     (US_MR_CLKO_Msk & ((value) << US_MR_CLKO_Pos))      
#define US_MR_OVER_Pos                        _U_(19)                                              /**< (US_MR) Oversampling Mode Position */
#define US_MR_OVER_Msk                        (_U_(0x1) << US_MR_OVER_Pos)                         /**< (US_MR) Oversampling Mode Mask */
#define US_MR_OVER(value)                     (US_MR_OVER_Msk & ((value) << US_MR_OVER_Pos))      
#define US_MR_INACK_Pos                       _U_(20)                                              /**< (US_MR) Inhibit Non Acknowledge Position */
#define US_MR_INACK_Msk                       (_U_(0x1) << US_MR_INACK_Pos)                        /**< (US_MR) Inhibit Non Acknowledge Mask */
#define US_MR_INACK(value)                    (US_MR_INACK_Msk & ((value) << US_MR_INACK_Pos))    
#define US_MR_DSNACK_Pos                      _U_(21)                                              /**< (US_MR) Disable Successive NACK Position */
#define US_MR_DSNACK_Msk                      (_U_(0x1) << US_MR_DSNACK_Pos)                       /**< (US_MR) Disable Successive NACK Mask */
#define US_MR_DSNACK(value)                   (US_MR_DSNACK_Msk & ((value) << US_MR_DSNACK_Pos))  
#define US_MR_INVDATA_Pos                     _U_(23)                                              /**< (US_MR) Inverted Data Position */
#define US_MR_INVDATA_Msk                     (_U_(0x1) << US_MR_INVDATA_Pos)                      /**< (US_MR) Inverted Data Mask */
#define US_MR_INVDATA(value)                  (US_MR_INVDATA_Msk & ((value) << US_MR_INVDATA_Pos))
#define US_MR_MAX_ITERATION_Pos               _U_(24)                                              /**< (US_MR) Maximum Number of Automatic Iteration Position */
#define US_MR_MAX_ITERATION_Msk               (_U_(0x7) << US_MR_MAX_ITERATION_Pos)                /**< (US_MR) Maximum Number of Automatic Iteration Mask */
#define US_MR_MAX_ITERATION(value)            (US_MR_MAX_ITERATION_Msk & ((value) << US_MR_MAX_ITERATION_Pos))
#define US_MR_FILTER_Pos                      _U_(28)                                              /**< (US_MR) Receive Line Filter Position */
#define US_MR_FILTER_Msk                      (_U_(0x1) << US_MR_FILTER_Pos)                       /**< (US_MR) Receive Line Filter Mask */
#define US_MR_FILTER(value)                   (US_MR_FILTER_Msk & ((value) << US_MR_FILTER_Pos))  
#define US_MR_Msk                             _U_(0x17BFFFFF)                                      /**< (US_MR) Register Mask  */

