virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/usart.h
/* -------- US_IDR : (USART Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define US_IDR_RXRDY_Pos                      _U_(0)                                               /**< (US_IDR) RXRDY Interrupt Disable Position */
#define US_IDR_RXRDY_Msk                      (_U_(0x1) << US_IDR_RXRDY_Pos)                       /**< (US_IDR) RXRDY Interrupt Disable Mask */
#define US_IDR_RXRDY(value)                   (US_IDR_RXRDY_Msk & ((value) << US_IDR_RXRDY_Pos))  
#define US_IDR_TXRDY_Pos                      _U_(1)                                               /**< (US_IDR) TXRDY Interrupt Disable Position */
#define US_IDR_TXRDY_Msk                      (_U_(0x1) << US_IDR_TXRDY_Pos)                       /**< (US_IDR) TXRDY Interrupt Disable Mask */
#define US_IDR_TXRDY(value)                   (US_IDR_TXRDY_Msk & ((value) << US_IDR_TXRDY_Pos))  
#define US_IDR_RXBRK_Pos                      _U_(2)                                               /**< (US_IDR) Receiver Break Interrupt Disable Position */
#define US_IDR_RXBRK_Msk                      (_U_(0x1) << US_IDR_RXBRK_Pos)                       /**< (US_IDR) Receiver Break Interrupt Disable Mask */
#define US_IDR_RXBRK(value)                   (US_IDR_RXBRK_Msk & ((value) << US_IDR_RXBRK_Pos))  
#define US_IDR_ENDRX_Pos                      _U_(3)                                               /**< (US_IDR) End of Receive Buffer Interrupt Enable (available in all USART modes of operation) Position */
#define US_IDR_ENDRX_Msk                      (_U_(0x1) << US_IDR_ENDRX_Pos)                       /**< (US_IDR) End of Receive Buffer Interrupt Enable (available in all USART modes of operation) Mask */
#define US_IDR_ENDRX(value)                   (US_IDR_ENDRX_Msk & ((value) << US_IDR_ENDRX_Pos))  
#define US_IDR_ENDTX_Pos                      _U_(4)                                               /**< (US_IDR) End of Transmit Buffer Interrupt Disable (available in all USART modes of operation) Position */
#define US_IDR_ENDTX_Msk                      (_U_(0x1) << US_IDR_ENDTX_Pos)                       /**< (US_IDR) End of Transmit Buffer Interrupt Disable (available in all USART modes of operation) Mask */
#define US_IDR_ENDTX(value)                   (US_IDR_ENDTX_Msk & ((value) << US_IDR_ENDTX_Pos))  
#define US_IDR_OVRE_Pos                       _U_(5)                                               /**< (US_IDR) Overrun Error Interrupt Enable Position */
#define US_IDR_OVRE_Msk                       (_U_(0x1) << US_IDR_OVRE_Pos)                        /**< (US_IDR) Overrun Error Interrupt Enable Mask */
#define US_IDR_OVRE(value)                    (US_IDR_OVRE_Msk & ((value) << US_IDR_OVRE_Pos))    
#define US_IDR_FRAME_Pos                      _U_(6)                                               /**< (US_IDR) Framing Error Interrupt Disable Position */
#define US_IDR_FRAME_Msk                      (_U_(0x1) << US_IDR_FRAME_Pos)                       /**< (US_IDR) Framing Error Interrupt Disable Mask */
#define US_IDR_FRAME(value)                   (US_IDR_FRAME_Msk & ((value) << US_IDR_FRAME_Pos))  
#define US_IDR_PARE_Pos                       _U_(7)                                               /**< (US_IDR) Parity Error Interrupt Disable Position */
#define US_IDR_PARE_Msk                       (_U_(0x1) << US_IDR_PARE_Pos)                        /**< (US_IDR) Parity Error Interrupt Disable Mask */
#define US_IDR_PARE(value)                    (US_IDR_PARE_Msk & ((value) << US_IDR_PARE_Pos))    
#define US_IDR_TIMEOUT_Pos                    _U_(8)                                               /**< (US_IDR) Time-out Interrupt Disable Position */
#define US_IDR_TIMEOUT_Msk                    (_U_(0x1) << US_IDR_TIMEOUT_Pos)                     /**< (US_IDR) Time-out Interrupt Disable Mask */
#define US_IDR_TIMEOUT(value)                 (US_IDR_TIMEOUT_Msk & ((value) << US_IDR_TIMEOUT_Pos))
#define US_IDR_TXEMPTY_Pos                    _U_(9)                                               /**< (US_IDR) TXEMPTY Interrupt Disable Position */
#define US_IDR_TXEMPTY_Msk                    (_U_(0x1) << US_IDR_TXEMPTY_Pos)                     /**< (US_IDR) TXEMPTY Interrupt Disable Mask */
#define US_IDR_TXEMPTY(value)                 (US_IDR_TXEMPTY_Msk & ((value) << US_IDR_TXEMPTY_Pos))
#define US_IDR_ITER_Pos                       _U_(10)                                              /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Position */
#define US_IDR_ITER_Msk                       (_U_(0x1) << US_IDR_ITER_Pos)                        /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Mask */
#define US_IDR_ITER(value)                    (US_IDR_ITER_Msk & ((value) << US_IDR_ITER_Pos))    
#define US_IDR_TXBUFE_Pos                     _U_(11)                                              /**< (US_IDR) Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation) Position */
#define US_IDR_TXBUFE_Msk                     (_U_(0x1) << US_IDR_TXBUFE_Pos)                      /**< (US_IDR) Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation) Mask */
#define US_IDR_TXBUFE(value)                  (US_IDR_TXBUFE_Msk & ((value) << US_IDR_TXBUFE_Pos))
#define US_IDR_RXBUFF_Pos                     _U_(12)                                              /**< (US_IDR) Receive Buffer Full Interrupt Enable (available in all USART modes of operation) Position */
#define US_IDR_RXBUFF_Msk                     (_U_(0x1) << US_IDR_RXBUFF_Pos)                      /**< (US_IDR) Receive Buffer Full Interrupt Enable (available in all USART modes of operation) Mask */
#define US_IDR_RXBUFF(value)                  (US_IDR_RXBUFF_Msk & ((value) << US_IDR_RXBUFF_Pos))
#define US_IDR_NACK_Pos                       _U_(13)                                              /**< (US_IDR) Non Acknowledge Interrupt Disable Position */
#define US_IDR_NACK_Msk                       (_U_(0x1) << US_IDR_NACK_Pos)                        /**< (US_IDR) Non Acknowledge Interrupt Disable Mask */
#define US_IDR_NACK(value)                    (US_IDR_NACK_Msk & ((value) << US_IDR_NACK_Pos))    
#define US_IDR_CTSIC_Pos                      _U_(19)                                              /**< (US_IDR) Clear to Send Input Change Interrupt Disable Position */
#define US_IDR_CTSIC_Msk                      (_U_(0x1) << US_IDR_CTSIC_Pos)                       /**< (US_IDR) Clear to Send Input Change Interrupt Disable Mask */
#define US_IDR_CTSIC(value)                   (US_IDR_CTSIC_Msk & ((value) << US_IDR_CTSIC_Pos))  
#define US_IDR_CMP_Pos                        _U_(22)                                              /**< (US_IDR) Comparison Interrupt Disable Position */
#define US_IDR_CMP_Msk                        (_U_(0x1) << US_IDR_CMP_Pos)                         /**< (US_IDR) Comparison Interrupt Disable Mask */
#define US_IDR_CMP(value)                     (US_IDR_CMP_Msk & ((value) << US_IDR_CMP_Pos))      
#define US_IDR_Msk                            _U_(0x00483FFF)                                      /**< (US_IDR) Register Mask  */


/* -------- US_IMR : (USART Offset: 0x10) ( R/ 32) Interrupt Mask Register -------- */
#define US_IMR_RXRDY_Pos                      _U_(0)                                               /**< (US_IMR) RXRDY Interrupt Mask Position */
#define US_IMR_RXRDY_Msk                      (_U_(0x1) << US_IMR_RXRDY_Pos)                       /**< (US_IMR) RXRDY Interrupt Mask Mask */
#define US_IMR_RXRDY(value)                   (US_IMR_RXRDY_Msk & ((value) << US_IMR_RXRDY_Pos))  
#define US_IMR_TXRDY_Pos                      _U_(1)                                               /**< (US_IMR) TXRDY Interrupt Mask Position */
#define US_IMR_TXRDY_Msk                      (_U_(0x1) << US_IMR_TXRDY_Pos)                       /**< (US_IMR) TXRDY Interrupt Mask Mask */
#define US_IMR_TXRDY(value)                   (US_IMR_TXRDY_Msk & ((value) << US_IMR_TXRDY_Pos))  
#define US_IMR_RXBRK_Pos                      _U_(2)                                               /**< (US_IMR) Receiver Break Interrupt Mask Position */
#define US_IMR_RXBRK_Msk                      (_U_(0x1) << US_IMR_RXBRK_Pos)                       /**< (US_IMR) Receiver Break Interrupt Mask Mask */
#define US_IMR_RXBRK(value)                   (US_IMR_RXBRK_Msk & ((value) << US_IMR_RXBRK_Pos))  
#define US_IMR_ENDRX_Pos                      _U_(3)                                               /**< (US_IMR) End of Receive Buffer Interrupt Mask (available in all USART modes of operation) Position */
#define US_IMR_ENDRX_Msk                      (_U_(0x1) << US_IMR_ENDRX_Pos)                       /**< (US_IMR) End of Receive Buffer Interrupt Mask (available in all USART modes of operation) Mask */
#define US_IMR_ENDRX(value)                   (US_IMR_ENDRX_Msk & ((value) << US_IMR_ENDRX_Pos))  
#define US_IMR_ENDTX_Pos                      _U_(4)                                               /**< (US_IMR) End of Transmit Buffer Interrupt Mask (available in all USART modes of operation) Position */
#define US_IMR_ENDTX_Msk                      (_U_(0x1) << US_IMR_ENDTX_Pos)                       /**< (US_IMR) End of Transmit Buffer Interrupt Mask (available in all USART modes of operation) Mask */
#define US_IMR_ENDTX(value)                   (US_IMR_ENDTX_Msk & ((value) << US_IMR_ENDTX_Pos))  
#define US_IMR_OVRE_Pos                       _U_(5)                                               /**< (US_IMR) Overrun Error Interrupt Mask Position */
#define US_IMR_OVRE_Msk                       (_U_(0x1) << US_IMR_OVRE_Pos)                        /**< (US_IMR) Overrun Error Interrupt Mask Mask */
#define US_IMR_OVRE(value)                    (US_IMR_OVRE_Msk & ((value) << US_IMR_OVRE_Pos))    
#define US_IMR_FRAME_Pos                      _U_(6)                                               /**< (US_IMR) Framing Error Interrupt Mask Position */
#define US_IMR_FRAME_Msk                      (_U_(0x1) << US_IMR_FRAME_Pos)                       /**< (US_IMR) Framing Error Interrupt Mask Mask */
#define US_IMR_FRAME(value)                   (US_IMR_FRAME_Msk & ((value) << US_IMR_FRAME_Pos))  
#define US_IMR_PARE_Pos                       _U_(7)                                               /**< (US_IMR) Parity Error Interrupt Mask Position */
#define US_IMR_PARE_Msk                       (_U_(0x1) << US_IMR_PARE_Pos)                        /**< (US_IMR) Parity Error Interrupt Mask Mask */
#define US_IMR_PARE(value)                    (US_IMR_PARE_Msk & ((value) << US_IMR_PARE_Pos))    
#define US_IMR_TIMEOUT_Pos                    _U_(8)                                               /**< (US_IMR) Time-out Interrupt Mask Position */
#define US_IMR_TIMEOUT_Msk                    (_U_(0x1) << US_IMR_TIMEOUT_Pos)                     /**< (US_IMR) Time-out Interrupt Mask Mask */
#define US_IMR_TIMEOUT(value)                 (US_IMR_TIMEOUT_Msk & ((value) << US_IMR_TIMEOUT_Pos))
#define US_IMR_TXEMPTY_Pos                    _U_(9)                                               /**< (US_IMR) TXEMPTY Interrupt Mask Position */
#define US_IMR_TXEMPTY_Msk                    (_U_(0x1) << US_IMR_TXEMPTY_Pos)                     /**< (US_IMR) TXEMPTY Interrupt Mask Mask */
#define US_IMR_TXEMPTY(value)                 (US_IMR_TXEMPTY_Msk & ((value) << US_IMR_TXEMPTY_Pos))
#define US_IMR_ITER_Pos                       _U_(10)                                              /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Position */
#define US_IMR_ITER_Msk                       (_U_(0x1) << US_IMR_ITER_Pos)                        /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Mask */
#define US_IMR_ITER(value)                    (US_IMR_ITER_Msk & ((value) << US_IMR_ITER_Pos))    
#define US_IMR_TXBUFE_Pos                     _U_(11)                                              /**< (US_IMR) Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation) Position */
#define US_IMR_TXBUFE_Msk                     (_U_(0x1) << US_IMR_TXBUFE_Pos)                      /**< (US_IMR) Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation) Mask */
#define US_IMR_TXBUFE(value)                  (US_IMR_TXBUFE_Msk & ((value) << US_IMR_TXBUFE_Pos))
#define US_IMR_RXBUFF_Pos                     _U_(12)                                              /**< (US_IMR) Receive Buffer Full Interrupt Mask (available in all USART modes of operation) Position */
#define US_IMR_RXBUFF_Msk                     (_U_(0x1) << US_IMR_RXBUFF_Pos)                      /**< (US_IMR) Receive Buffer Full Interrupt Mask (available in all USART modes of operation) Mask */
#define US_IMR_RXBUFF(value)                  (US_IMR_RXBUFF_Msk & ((value) << US_IMR_RXBUFF_Pos))
#define US_IMR_NACK_Pos                       _U_(13)                                              /**< (US_IMR) Non Acknowledge Interrupt Mask Position */
#define US_IMR_NACK_Msk                       (_U_(0x1) << US_IMR_NACK_Pos)                        /**< (US_IMR) Non Acknowledge Interrupt Mask Mask */
#define US_IMR_NACK(value)                    (US_IMR_NACK_Msk & ((value) << US_IMR_NACK_Pos))    
#define US_IMR_CTSIC_Pos                      _U_(19)                                              /**< (US_IMR) Clear to Send Input Change Interrupt Mask Position */
#define US_IMR_CTSIC_Msk                      (_U_(0x1) << US_IMR_CTSIC_Pos)                       /**< (US_IMR) Clear to Send Input Change Interrupt Mask Mask */
#define US_IMR_CTSIC(value)                   (US_IMR_CTSIC_Msk & ((value) << US_IMR_CTSIC_Pos))  
#define US_IMR_CMP_Pos                        _U_(22)                                              /**< (US_IMR) Comparison Interrupt Mask Position */
#define US_IMR_CMP_Msk                        (_U_(0x1) << US_IMR_CMP_Pos)                         /**< (US_IMR) Comparison Interrupt Mask Mask */
#define US_IMR_CMP(value)                     (US_IMR_CMP_Msk & ((value) << US_IMR_CMP_Pos))      
#define US_IMR_Msk                            _U_(0x00483FFF)                                      /**< (US_IMR) Register Mask  */


