virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/usart.h
/* -------- US_CSR : (USART Offset: 0x14) ( R/ 32) Channel Status Register -------- */
#define US_CSR_RXRDY_Pos                      _U_(0)                                               /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Position */
#define US_CSR_RXRDY_Msk                      (_U_(0x1) << US_CSR_RXRDY_Pos)                       /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Mask */
#define US_CSR_RXRDY(value)                   (US_CSR_RXRDY_Msk & ((value) << US_CSR_RXRDY_Pos))  
#define US_CSR_TXRDY_Pos                      _U_(1)                                               /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Position */
#define US_CSR_TXRDY_Msk                      (_U_(0x1) << US_CSR_TXRDY_Pos)                       /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Mask */
#define US_CSR_TXRDY(value)                   (US_CSR_TXRDY_Msk & ((value) << US_CSR_TXRDY_Pos))  
#define US_CSR_RXBRK_Pos                      _U_(2)                                               /**< (US_CSR) Break Received/End of Break (cleared by writing a one to the bit US_CR.RSTSTA) Position */
#define US_CSR_RXBRK_Msk                      (_U_(0x1) << US_CSR_RXBRK_Pos)                       /**< (US_CSR) Break Received/End of Break (cleared by writing a one to the bit US_CR.RSTSTA) Mask */
#define US_CSR_RXBRK(value)                   (US_CSR_RXBRK_Msk & ((value) << US_CSR_RXBRK_Pos))  
#define US_CSR_ENDRX_Pos                      _U_(3)                                               /**< (US_CSR) End of RX Buffer (cleared by writing US_RCR or US_RNCR) Position */
#define US_CSR_ENDRX_Msk                      (_U_(0x1) << US_CSR_ENDRX_Pos)                       /**< (US_CSR) End of RX Buffer (cleared by writing US_RCR or US_RNCR) Mask */
#define US_CSR_ENDRX(value)                   (US_CSR_ENDRX_Msk & ((value) << US_CSR_ENDRX_Pos))  
#define US_CSR_ENDTX_Pos                      _U_(4)                                               /**< (US_CSR) End of TX Buffer (cleared by writing US_TCR or US_TNCR) Position */
#define US_CSR_ENDTX_Msk                      (_U_(0x1) << US_CSR_ENDTX_Pos)                       /**< (US_CSR) End of TX Buffer (cleared by writing US_TCR or US_TNCR) Mask */
#define US_CSR_ENDTX(value)                   (US_CSR_ENDTX_Msk & ((value) << US_CSR_ENDTX_Pos))  
#define US_CSR_OVRE_Pos                       _U_(5)                                               /**< (US_CSR) Overrun Error (cleared by writing a one to the bit US_CR.RSTSTA) Position */
#define US_CSR_OVRE_Msk                       (_U_(0x1) << US_CSR_OVRE_Pos)                        /**< (US_CSR) Overrun Error (cleared by writing a one to the bit US_CR.RSTSTA) Mask */
#define US_CSR_OVRE(value)                    (US_CSR_OVRE_Msk & ((value) << US_CSR_OVRE_Pos))    
#define US_CSR_FRAME_Pos                      _U_(6)                                               /**< (US_CSR) Framing Error (cleared by writing a one to the bit US_CR.RSTSTA) Position */
#define US_CSR_FRAME_Msk                      (_U_(0x1) << US_CSR_FRAME_Pos)                       /**< (US_CSR) Framing Error (cleared by writing a one to the bit US_CR.RSTSTA) Mask */
#define US_CSR_FRAME(value)                   (US_CSR_FRAME_Msk & ((value) << US_CSR_FRAME_Pos))  
#define US_CSR_PARE_Pos                       _U_(7)                                               /**< (US_CSR) Parity Error (cleared by writing a one to the US_CR.RSTSTA) Position */
#define US_CSR_PARE_Msk                       (_U_(0x1) << US_CSR_PARE_Pos)                        /**< (US_CSR) Parity Error (cleared by writing a one to the US_CR.RSTSTA) Mask */
#define US_CSR_PARE(value)                    (US_CSR_PARE_Msk & ((value) << US_CSR_PARE_Pos))    
#define US_CSR_TIMEOUT_Pos                    _U_(8)                                               /**< (US_CSR) Receiver Time-out (cleared by writing a one to the bit US_CR.STTTO) Position */
#define US_CSR_TIMEOUT_Msk                    (_U_(0x1) << US_CSR_TIMEOUT_Pos)                     /**< (US_CSR) Receiver Time-out (cleared by writing a one to the bit US_CR.STTTO) Mask */
#define US_CSR_TIMEOUT(value)                 (US_CSR_TIMEOUT_Msk & ((value) << US_CSR_TIMEOUT_Pos))
#define US_CSR_TXEMPTY_Pos                    _U_(9)                                               /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Position */
#define US_CSR_TXEMPTY_Msk                    (_U_(0x1) << US_CSR_TXEMPTY_Pos)                     /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Mask */
#define US_CSR_TXEMPTY(value)                 (US_CSR_TXEMPTY_Msk & ((value) << US_CSR_TXEMPTY_Pos))
#define US_CSR_ITER_Pos                       _U_(10)                                              /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to the bit US_CR.RSTIT) Position */
#define US_CSR_ITER_Msk                       (_U_(0x1) << US_CSR_ITER_Pos)                        /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to the bit US_CR.RSTIT) Mask */
#define US_CSR_ITER(value)                    (US_CSR_ITER_Msk & ((value) << US_CSR_ITER_Pos))    
#define US_CSR_TXBUFE_Pos                     _U_(11)                                              /**< (US_CSR) TX Buffer Empty (cleared by writing US_TCR or US_TNCR) Position */
#define US_CSR_TXBUFE_Msk                     (_U_(0x1) << US_CSR_TXBUFE_Pos)                      /**< (US_CSR) TX Buffer Empty (cleared by writing US_TCR or US_TNCR) Mask */
#define US_CSR_TXBUFE(value)                  (US_CSR_TXBUFE_Msk & ((value) << US_CSR_TXBUFE_Pos))
#define US_CSR_RXBUFF_Pos                     _U_(12)                                              /**< (US_CSR) RX Buffer Full (cleared by writing US_RCR or US_RNCR) Position */
#define US_CSR_RXBUFF_Msk                     (_U_(0x1) << US_CSR_RXBUFF_Pos)                      /**< (US_CSR) RX Buffer Full (cleared by writing US_RCR or US_RNCR) Mask */
#define US_CSR_RXBUFF(value)                  (US_CSR_RXBUFF_Msk & ((value) << US_CSR_RXBUFF_Pos))
#define US_CSR_NACK_Pos                       _U_(13)                                              /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to the bit US_CR.RSTNACK) Position */
#define US_CSR_NACK_Msk                       (_U_(0x1) << US_CSR_NACK_Pos)                        /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to the bit US_CR.RSTNACK) Mask */
#define US_CSR_NACK(value)                    (US_CSR_NACK_Msk & ((value) << US_CSR_NACK_Pos))    
#define US_CSR_CTSIC_Pos                      _U_(19)                                              /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Position */
#define US_CSR_CTSIC_Msk                      (_U_(0x1) << US_CSR_CTSIC_Pos)                       /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Mask */
#define US_CSR_CTSIC(value)                   (US_CSR_CTSIC_Msk & ((value) << US_CSR_CTSIC_Pos))  
#define US_CSR_CMP_Pos                        _U_(22)                                              /**< (US_CSR) Comparison Status (cleared by writing a one to the bit US_CR.RSTSTA command) Position */
#define US_CSR_CMP_Msk                        (_U_(0x1) << US_CSR_CMP_Pos)                         /**< (US_CSR) Comparison Status (cleared by writing a one to the bit US_CR.RSTSTA command) Mask */
#define US_CSR_CMP(value)                     (US_CSR_CMP_Msk & ((value) << US_CSR_CMP_Pos))      
#define US_CSR_CTS_Pos                        _U_(23)                                              /**< (US_CSR) Image of CTS Input Position */
#define US_CSR_CTS_Msk                        (_U_(0x1) << US_CSR_CTS_Pos)                         /**< (US_CSR) Image of CTS Input Mask */
#define US_CSR_CTS(value)                     (US_CSR_CTS_Msk & ((value) << US_CSR_CTS_Pos))      
#define US_CSR_Msk                            _U_(0x00C83FFF)                                      /**< (US_CSR) Register Mask  */


