virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/usart.h
/* -------- US_LINBRR : (USART Offset: 0x5C) ( R/ 32) LIN Baud Rate Register -------- */
#define US_LINBRR_LINCD_Pos                   _U_(0)                                               /**< (US_LINBRR) Clock Divider after Synchronization Position */
#define US_LINBRR_LINCD_Msk                   (_U_(0xFFFF) << US_LINBRR_LINCD_Pos)                 /**< (US_LINBRR) Clock Divider after Synchronization Mask */
#define US_LINBRR_LINCD(value)                (US_LINBRR_LINCD_Msk & ((value) << US_LINBRR_LINCD_Pos))
#define US_LINBRR_LINFP_Pos                   _U_(16)                                              /**< (US_LINBRR) Fractional Part after Synchronization Position */
#define US_LINBRR_LINFP_Msk                   (_U_(0x7) << US_LINBRR_LINFP_Pos)                    /**< (US_LINBRR) Fractional Part after Synchronization Mask */
#define US_LINBRR_LINFP(value)                (US_LINBRR_LINFP_Msk & ((value) << US_LINBRR_LINFP_Pos))
#define US_LINBRR_Msk                         _U_(0x0007FFFF)                                      /**< (US_LINBRR) Register Mask  */


/* -------- US_CMPR : (USART Offset: 0x90) (R/W 32) Comparison Register -------- */
#define US_CMPR_VAL1_Pos                      _U_(0)                                               /**< (US_CMPR) First Comparison Value for Received Character Position */
#define US_CMPR_VAL1_Msk                      (_U_(0x1FF) << US_CMPR_VAL1_Pos)                     /**< (US_CMPR) First Comparison Value for Received Character Mask */
#define US_CMPR_VAL1(value)                   (US_CMPR_VAL1_Msk & ((value) << US_CMPR_VAL1_Pos))  
#define US_CMPR_CMPMODE_Pos                   _U_(12)                                              /**< (US_CMPR) Comparison Mode Position */
#define US_CMPR_CMPMODE_Msk                   (_U_(0x1) << US_CMPR_CMPMODE_Pos)                    /**< (US_CMPR) Comparison Mode Mask */
#define US_CMPR_CMPMODE(value)                (US_CMPR_CMPMODE_Msk & ((value) << US_CMPR_CMPMODE_Pos))
#define   US_CMPR_CMPMODE_FLAG_ONLY_Val       _U_(0x0)                                             /**< (US_CMPR) Any character is received and comparison function drives CMP flag.  */
#define   US_CMPR_CMPMODE_START_CONDITION_Val _U_(0x1)                                             /**< (US_CMPR) Comparison condition must be met to start reception of all incoming charactersuntil REQCLR is set.  */
#define US_CMPR_CMPMODE_FLAG_ONLY             (US_CMPR_CMPMODE_FLAG_ONLY_Val << US_CMPR_CMPMODE_Pos) /**< (US_CMPR) Any character is received and comparison function drives CMP flag. Position  */
#define US_CMPR_CMPMODE_START_CONDITION       (US_CMPR_CMPMODE_START_CONDITION_Val << US_CMPR_CMPMODE_Pos) /**< (US_CMPR) Comparison condition must be met to start reception of all incoming charactersuntil REQCLR is set. Position  */
#define US_CMPR_CMPPAR_Pos                    _U_(14)                                              /**< (US_CMPR) Compare Parity Position */
#define US_CMPR_CMPPAR_Msk                    (_U_(0x1) << US_CMPR_CMPPAR_Pos)                     /**< (US_CMPR) Compare Parity Mask */
#define US_CMPR_CMPPAR(value)                 (US_CMPR_CMPPAR_Msk & ((value) << US_CMPR_CMPPAR_Pos))
#define US_CMPR_VAL2_Pos                      _U_(16)                                              /**< (US_CMPR) Second Comparison Value for Received Character Position */
#define US_CMPR_VAL2_Msk                      (_U_(0x1FF) << US_CMPR_VAL2_Pos)                     /**< (US_CMPR) Second Comparison Value for Received Character Mask */
#define US_CMPR_VAL2(value)                   (US_CMPR_VAL2_Msk & ((value) << US_CMPR_VAL2_Pos))  
#define US_CMPR_Msk                           _U_(0x01FF51FF)                                      /**< (US_CMPR) Register Mask  */


/* -------- US_WPMR : (USART Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define US_WPMR_WPEN_Pos                      _U_(0)                                               /**< (US_WPMR) Write Protection Enable Position */
#define US_WPMR_WPEN_Msk                      (_U_(0x1) << US_WPMR_WPEN_Pos)                       /**< (US_WPMR) Write Protection Enable Mask */
#define US_WPMR_WPEN(value)                   (US_WPMR_WPEN_Msk & ((value) << US_WPMR_WPEN_Pos))  
#define US_WPMR_WPKEY_Pos                     _U_(8)                                               /**< (US_WPMR) Write Protection Key Position */
#define US_WPMR_WPKEY_Msk                     (_U_(0xFFFFFF) << US_WPMR_WPKEY_Pos)                 /**< (US_WPMR) Write Protection Key Mask */
#define US_WPMR_WPKEY(value)                  (US_WPMR_WPKEY_Msk & ((value) << US_WPMR_WPKEY_Pos))
#define   US_WPMR_WPKEY_PASSWD_Val            _U_(0x555341)                                        /**< (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define US_WPMR_WPKEY_PASSWD                  (US_WPMR_WPKEY_PASSWD_Val << US_WPMR_WPKEY_Pos)      /**< (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define US_WPMR_Msk                           _U_(0xFFFFFF01)                                      /**< (US_WPMR) Register Mask  */


/* -------- US_WPSR : (USART Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define US_WPSR_WPVS_Pos                      _U_(0)                                               /**< (US_WPSR) Write Protection Violation Status Position */
#define US_WPSR_WPVS_Msk                      (_U_(0x1) << US_WPSR_WPVS_Pos)                       /**< (US_WPSR) Write Protection Violation Status Mask */
#define US_WPSR_WPVS(value)                   (US_WPSR_WPVS_Msk & ((value) << US_WPSR_WPVS_Pos))  
#define US_WPSR_WPVSRC_Pos                    _U_(8)                                               /**< (US_WPSR) Write Protection Violation Source Position */
#define US_WPSR_WPVSRC_Msk                    (_U_(0xFFFF) << US_WPSR_WPVSRC_Pos)                  /**< (US_WPSR) Write Protection Violation Source Mask */
#define US_WPSR_WPVSRC(value)                 (US_WPSR_WPVSRC_Msk & ((value) << US_WPSR_WPVSRC_Pos))
#define US_WPSR_Msk                           _U_(0x00FFFF01)                                      /**< (US_WPSR) Register Mask  */


/* -------- US_RPR : (USART Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define US_RPR_RXPTR_Pos                      _U_(0)                                               /**< (US_RPR) Receive Pointer Register Position */
#define US_RPR_RXPTR_Msk                      (_U_(0xFFFFFFFF) << US_RPR_RXPTR_Pos)                /**< (US_RPR) Receive Pointer Register Mask */
#define US_RPR_RXPTR(value)                   (US_RPR_RXPTR_Msk & ((value) << US_RPR_RXPTR_Pos))  
#define US_RPR_Msk                            _U_(0xFFFFFFFF)                                      /**< (US_RPR) Register Mask  */


/* -------- US_RCR : (USART Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define US_RCR_RXCTR_Pos                      _U_(0)                                               /**< (US_RCR) Receive Counter Register Position */
#define US_RCR_RXCTR_Msk                      (_U_(0xFFFF) << US_RCR_RXCTR_Pos)                    /**< (US_RCR) Receive Counter Register Mask */
#define US_RCR_RXCTR(value)                   (US_RCR_RXCTR_Msk & ((value) << US_RCR_RXCTR_Pos))  
#define US_RCR_Msk                            _U_(0x0000FFFF)                                      /**< (US_RCR) Register Mask  */


/* -------- US_TPR : (USART Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define US_TPR_TXPTR_Pos                      _U_(0)                                               /**< (US_TPR) Transmit Counter Register Position */
#define US_TPR_TXPTR_Msk                      (_U_(0xFFFFFFFF) << US_TPR_TXPTR_Pos)                /**< (US_TPR) Transmit Counter Register Mask */
#define US_TPR_TXPTR(value)                   (US_TPR_TXPTR_Msk & ((value) << US_TPR_TXPTR_Pos))  
#define US_TPR_Msk                            _U_(0xFFFFFFFF)                                      /**< (US_TPR) Register Mask  */


/* -------- US_TCR : (USART Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define US_TCR_TXCTR_Pos                      _U_(0)                                               /**< (US_TCR) Transmit Counter Register Position */
#define US_TCR_TXCTR_Msk                      (_U_(0xFFFF) << US_TCR_TXCTR_Pos)                    /**< (US_TCR) Transmit Counter Register Mask */
#define US_TCR_TXCTR(value)                   (US_TCR_TXCTR_Msk & ((value) << US_TCR_TXCTR_Pos))  
#define US_TCR_Msk                            _U_(0x0000FFFF)                                      /**< (US_TCR) Register Mask  */


/* -------- US_RNPR : (USART Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define US_RNPR_RXNPTR_Pos                    _U_(0)                                               /**< (US_RNPR) Receive Next Pointer Position */
#define US_RNPR_RXNPTR_Msk                    (_U_(0xFFFFFFFF) << US_RNPR_RXNPTR_Pos)              /**< (US_RNPR) Receive Next Pointer Mask */
#define US_RNPR_RXNPTR(value)                 (US_RNPR_RXNPTR_Msk & ((value) << US_RNPR_RXNPTR_Pos))
#define US_RNPR_Msk                           _U_(0xFFFFFFFF)                                      /**< (US_RNPR) Register Mask  */


/* -------- US_RNCR : (USART Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define US_RNCR_RXNCTR_Pos                    _U_(0)                                               /**< (US_RNCR) Receive Next Counter Position */
#define US_RNCR_RXNCTR_Msk                    (_U_(0xFFFF) << US_RNCR_RXNCTR_Pos)                  /**< (US_RNCR) Receive Next Counter Mask */
#define US_RNCR_RXNCTR(value)                 (US_RNCR_RXNCTR_Msk & ((value) << US_RNCR_RXNCTR_Pos))
#define US_RNCR_Msk                           _U_(0x0000FFFF)                                      /**< (US_RNCR) Register Mask  */


