virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/usart.h
/* -------- US_TNPR : (USART Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define US_TNPR_TXNPTR_Pos                    _U_(0)                                               /**< (US_TNPR) Transmit Next Pointer Position */
#define US_TNPR_TXNPTR_Msk                    (_U_(0xFFFFFFFF) << US_TNPR_TXNPTR_Pos)              /**< (US_TNPR) Transmit Next Pointer Mask */
#define US_TNPR_TXNPTR(value)                 (US_TNPR_TXNPTR_Msk & ((value) << US_TNPR_TXNPTR_Pos))
#define US_TNPR_Msk                           _U_(0xFFFFFFFF)                                      /**< (US_TNPR) Register Mask  */


/* -------- US_TNCR : (USART Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define US_TNCR_TXNCTR_Pos                    _U_(0)                                               /**< (US_TNCR) Transmit Counter Next Position */
#define US_TNCR_TXNCTR_Msk                    (_U_(0xFFFF) << US_TNCR_TXNCTR_Pos)                  /**< (US_TNCR) Transmit Counter Next Mask */
#define US_TNCR_TXNCTR(value)                 (US_TNCR_TXNCTR_Msk & ((value) << US_TNCR_TXNCTR_Pos))
#define US_TNCR_Msk                           _U_(0x0000FFFF)                                      /**< (US_TNCR) Register Mask  */


/* -------- US_PTCR : (USART Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define US_PTCR_RXTEN_Pos                     _U_(0)                                               /**< (US_PTCR) Receiver Transfer Enable Position */
#define US_PTCR_RXTEN_Msk                     (_U_(0x1) << US_PTCR_RXTEN_Pos)                      /**< (US_PTCR) Receiver Transfer Enable Mask */
#define US_PTCR_RXTEN(value)                  (US_PTCR_RXTEN_Msk & ((value) << US_PTCR_RXTEN_Pos))
#define US_PTCR_RXTDIS_Pos                    _U_(1)                                               /**< (US_PTCR) Receiver Transfer Disable Position */
#define US_PTCR_RXTDIS_Msk                    (_U_(0x1) << US_PTCR_RXTDIS_Pos)                     /**< (US_PTCR) Receiver Transfer Disable Mask */
#define US_PTCR_RXTDIS(value)                 (US_PTCR_RXTDIS_Msk & ((value) << US_PTCR_RXTDIS_Pos))
#define US_PTCR_TXTEN_Pos                     _U_(8)                                               /**< (US_PTCR) Transmitter Transfer Enable Position */
#define US_PTCR_TXTEN_Msk                     (_U_(0x1) << US_PTCR_TXTEN_Pos)                      /**< (US_PTCR) Transmitter Transfer Enable Mask */
#define US_PTCR_TXTEN(value)                  (US_PTCR_TXTEN_Msk & ((value) << US_PTCR_TXTEN_Pos))
#define US_PTCR_TXTDIS_Pos                    _U_(9)                                               /**< (US_PTCR) Transmitter Transfer Disable Position */
#define US_PTCR_TXTDIS_Msk                    (_U_(0x1) << US_PTCR_TXTDIS_Pos)                     /**< (US_PTCR) Transmitter Transfer Disable Mask */
#define US_PTCR_TXTDIS(value)                 (US_PTCR_TXTDIS_Msk & ((value) << US_PTCR_TXTDIS_Pos))
#define US_PTCR_RXCBEN_Pos                    _U_(16)                                              /**< (US_PTCR) Receiver Circular Buffer Enable Position */
#define US_PTCR_RXCBEN_Msk                    (_U_(0x1) << US_PTCR_RXCBEN_Pos)                     /**< (US_PTCR) Receiver Circular Buffer Enable Mask */
#define US_PTCR_RXCBEN(value)                 (US_PTCR_RXCBEN_Msk & ((value) << US_PTCR_RXCBEN_Pos))
#define US_PTCR_RXCBDIS_Pos                   _U_(17)                                              /**< (US_PTCR) Receiver Circular Buffer Disable Position */
#define US_PTCR_RXCBDIS_Msk                   (_U_(0x1) << US_PTCR_RXCBDIS_Pos)                    /**< (US_PTCR) Receiver Circular Buffer Disable Mask */
#define US_PTCR_RXCBDIS(value)                (US_PTCR_RXCBDIS_Msk & ((value) << US_PTCR_RXCBDIS_Pos))
#define US_PTCR_TXCBEN_Pos                    _U_(18)                                              /**< (US_PTCR) Transmitter Circular Buffer Enable Position */
#define US_PTCR_TXCBEN_Msk                    (_U_(0x1) << US_PTCR_TXCBEN_Pos)                     /**< (US_PTCR) Transmitter Circular Buffer Enable Mask */
#define US_PTCR_TXCBEN(value)                 (US_PTCR_TXCBEN_Msk & ((value) << US_PTCR_TXCBEN_Pos))
#define US_PTCR_TXCBDIS_Pos                   _U_(19)                                              /**< (US_PTCR) Transmitter Circular Buffer Disable Position */
#define US_PTCR_TXCBDIS_Msk                   (_U_(0x1) << US_PTCR_TXCBDIS_Pos)                    /**< (US_PTCR) Transmitter Circular Buffer Disable Mask */
#define US_PTCR_TXCBDIS(value)                (US_PTCR_TXCBDIS_Msk & ((value) << US_PTCR_TXCBDIS_Pos))
#define US_PTCR_ERRCLR_Pos                    _U_(24)                                              /**< (US_PTCR) Transfer Bus Error Clear Position */
#define US_PTCR_ERRCLR_Msk                    (_U_(0x1) << US_PTCR_ERRCLR_Pos)                     /**< (US_PTCR) Transfer Bus Error Clear Mask */
#define US_PTCR_ERRCLR(value)                 (US_PTCR_ERRCLR_Msk & ((value) << US_PTCR_ERRCLR_Pos))
#define US_PTCR_Msk                           _U_(0x010F0303)                                      /**< (US_PTCR) Register Mask  */


/* -------- US_PTSR : (USART Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define US_PTSR_RXTEN_Pos                     _U_(0)                                               /**< (US_PTSR) Receiver Transfer Enable Position */
#define US_PTSR_RXTEN_Msk                     (_U_(0x1) << US_PTSR_RXTEN_Pos)                      /**< (US_PTSR) Receiver Transfer Enable Mask */
#define US_PTSR_RXTEN(value)                  (US_PTSR_RXTEN_Msk & ((value) << US_PTSR_RXTEN_Pos))
#define US_PTSR_TXTEN_Pos                     _U_(8)                                               /**< (US_PTSR) Transmitter Transfer Enable Position */
#define US_PTSR_TXTEN_Msk                     (_U_(0x1) << US_PTSR_TXTEN_Pos)                      /**< (US_PTSR) Transmitter Transfer Enable Mask */
#define US_PTSR_TXTEN(value)                  (US_PTSR_TXTEN_Msk & ((value) << US_PTSR_TXTEN_Pos))
#define US_PTSR_RXCBEN_Pos                    _U_(16)                                              /**< (US_PTSR) Receiver Circular Buffer Enable Position */
#define US_PTSR_RXCBEN_Msk                    (_U_(0x1) << US_PTSR_RXCBEN_Pos)                     /**< (US_PTSR) Receiver Circular Buffer Enable Mask */
#define US_PTSR_RXCBEN(value)                 (US_PTSR_RXCBEN_Msk & ((value) << US_PTSR_RXCBEN_Pos))
#define US_PTSR_TXCBEN_Pos                    _U_(18)                                              /**< (US_PTSR) Transmitter Circular Buffer Enable Position */
#define US_PTSR_TXCBEN_Msk                    (_U_(0x1) << US_PTSR_TXCBEN_Pos)                     /**< (US_PTSR) Transmitter Circular Buffer Enable Mask */
#define US_PTSR_TXCBEN(value)                 (US_PTSR_TXCBEN_Msk & ((value) << US_PTSR_TXCBEN_Pos))
#define US_PTSR_ERR_Pos                       _U_(24)                                              /**< (US_PTSR) Transfer Bus Error Position */
#define US_PTSR_ERR_Msk                       (_U_(0x1) << US_PTSR_ERR_Pos)                        /**< (US_PTSR) Transfer Bus Error Mask */
#define US_PTSR_ERR(value)                    (US_PTSR_ERR_Msk & ((value) << US_PTSR_ERR_Pos))    
#define US_PTSR_Msk                           _U_(0x01050101)                                      /**< (US_PTSR) Register Mask  */


/** \brief USART register offsets definitions */
#define US_CR_REG_OFST                 (0x00)              /**< (US_CR) Control Register Offset */
#define US_MR_REG_OFST                 (0x04)              /**< (US_MR) Mode Register Offset */
#define US_IER_REG_OFST                (0x08)              /**< (US_IER) Interrupt Enable Register Offset */
#define US_IDR_REG_OFST                (0x0C)              /**< (US_IDR) Interrupt Disable Register Offset */
#define US_IMR_REG_OFST                (0x10)              /**< (US_IMR) Interrupt Mask Register Offset */
#define US_CSR_REG_OFST                (0x14)              /**< (US_CSR) Channel Status Register Offset */
#define US_RHR_REG_OFST                (0x18)              /**< (US_RHR) Receive Holding Register Offset */
#define US_THR_REG_OFST                (0x1C)              /**< (US_THR) Transmit Holding Register Offset */
#define US_BRGR_REG_OFST               (0x20)              /**< (US_BRGR) Baud Rate Generator Register Offset */
#define US_RTOR_REG_OFST               (0x24)              /**< (US_RTOR) Receiver Time-out Register Offset */
#define US_TTGR_REG_OFST               (0x28)              /**< (US_TTGR) Transmitter Timeguard Register Offset */
#define US_FIDI_REG_OFST               (0x40)              /**< (US_FIDI) FI DI Ratio Register Offset */
#define US_NER_REG_OFST                (0x44)              /**< (US_NER) Number of Errors Register Offset */
#define US_IF_REG_OFST                 (0x4C)              /**< (US_IF) IrDA Filter Register Offset */
#define US_LINMR_REG_OFST              (0x54)              /**< (US_LINMR) LIN Mode Register Offset */
#define US_LINIR_REG_OFST              (0x58)              /**< (US_LINIR) LIN Identifier Register Offset */
#define US_LINBRR_REG_OFST             (0x5C)              /**< (US_LINBRR) LIN Baud Rate Register Offset */
#define US_CMPR_REG_OFST               (0x90)              /**< (US_CMPR) Comparison Register Offset */
#define US_WPMR_REG_OFST               (0xE4)              /**< (US_WPMR) Write Protection Mode Register Offset */
#define US_WPSR_REG_OFST               (0xE8)              /**< (US_WPSR) Write Protection Status Register Offset */
#define US_RPR_REG_OFST                (0x100)             /**< (US_RPR) Receive Pointer Register Offset */
#define US_RCR_REG_OFST                (0x104)             /**< (US_RCR) Receive Counter Register Offset */
#define US_TPR_REG_OFST                (0x108)             /**< (US_TPR) Transmit Pointer Register Offset */
#define US_TCR_REG_OFST                (0x10C)             /**< (US_TCR) Transmit Counter Register Offset */
#define US_RNPR_REG_OFST               (0x110)             /**< (US_RNPR) Receive Next Pointer Register Offset */
#define US_RNCR_REG_OFST               (0x114)             /**< (US_RNCR) Receive Next Counter Register Offset */
#define US_TNPR_REG_OFST               (0x118)             /**< (US_TNPR) Transmit Next Pointer Register Offset */
#define US_TNCR_REG_OFST               (0x11C)             /**< (US_TNCR) Transmit Next Counter Register Offset */
#define US_PTCR_REG_OFST               (0x120)             /**< (US_PTCR) Transfer Control Register Offset */
#define US_PTSR_REG_OFST               (0x124)             /**< (US_PTSR) Transfer Status Register Offset */

